Revit 2024 API
BuiltInFailures.SketchFailures.InvalidSketchForBuildingpad Property
 Pad sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidSketchForBuildingpad { get; }
Visual Basic
Public Shared ReadOnly Property InvalidSketchForBuildingpad As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidSketchForBuildingpad {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace